ReneLuedecke/stm32-helium-demo/Projects/NUCLEO-N657X0-Q/Examples/CORTEX/CORTEX_HELIUM/FSBL/Src/main.c
/* USER CODE END 0 */
static inline uint16_t gain_to_q15(float gain)
{
    if (gain < 0.0f) gain = 0.0f;
    if (gain > 1.9999f) gain = 1.9999f;
    return (uint16_t)(gain * 32768.0f + 0.5f);
}

void process_mve(const uint16_t *src, const uint16_t *gain, uint16_t *dst, int n, int16_t offset)
{
    int i = 0;
    const int step = 8;
    const uint8_t shift = 15;

    const uint32x4_t rnd = vdupq_n_u32(1u << (shift - 1));
    const int32x4_t off32 = vdupq_n_s32(offset);
    const int32x4_t zeroS = vdupq_n_s32(0);
    const int32x4_t negSh = vdupq_n_s32(-15);

    for (; i <= n - step; i += step)
    {
        uint16x8_t s16 = vld1q_u16(src + i);
        uint16x8_t g16 = vld1q_u16(gain + i);

        uint32x4_t lo32 = vmullbq_int_u16(s16, g16);
        uint32x4_t hi32 = vmulltq_int_u16(s16, g16);

        lo32 = vaddq_u32(lo32, rnd);
        hi32 = vaddq_u32(hi32, rnd);

        lo32 = vshlq_u32(lo32, negSh);
        hi32 = vshlq_u32(hi32, negSh);

        int32x4_t loS = vqaddq_s32(vreinterpretq_s32_u32(lo32), off32);
        int32x4_t hiS = vqaddq_s32(vreinterpretq_s32_u32(hi32), off32);

        loS = vmaxq_s32(loS, zeroS);
        hiS = vmaxq_s32(hiS, zeroS);

        uint32x4_t loU = vreinterpretq_u32_s32(loS);
        uint32x4_t hiU = vreinterpretq_u32_s32(hiS);

        uint16x8_t out = vdupq_n_u16(0);
        out = vqmovnbq_u32(out, loU);
        out = vqmovntq_u32(out, hiU);

        vst1q_u16(dst + i, out);
    }

    for (; i < n; ++i) {
        uint32_t prod = (uint32_t)src[i] * (uint32_t)gain[i];
        uint32_t rounded = prod + (1u << (shift - 1));
        uint32_t shifted = rounded >> shift;
        int32_t result = (int32_t)shifted + (int32_t)offset;

        if (result < 0) result = 0;
        if (result > 65535) result = 65535;

        dst[i] = (uint16_t)result;
    }
}
void planck_lut_mve(const uint16_t *src, uint16_t *dst, int n)
{
    int i = 0;
    for (; i <= n - 8; i += 8)
    {
        uint16x8_t idx = vld1q_u16(src + i);
        uint16x8_t val = vldrhq_gather_shifted_offset_u16(planck_table, idx);
        vst1q_u16(dst + i, val);
    }
    for (; i < n; ++i) dst[i] = planck_table[src[i]];
}

/* USER CODE BEGIN 4 */
static inline void DWT_CycleCounter_Init(void)
{
    // Trace/DWT einschalten
    CoreDebug->DEMCR |= CoreDebug_DEMCR_TRCENA_Msk;

    // Manche MCUs haben ein verriegeltes DWT -> via LAR unlocken
    #if defined(DWT_LAR)
    DWT->LAR = 0xC5ACCE55;   // <-- richtiges Register (nicht LSR)
    #endif

    DWT->CYCCNT = 0;
    DWT->CTRL  |= DWT_CTRL_CYCCNTENA_Msk;
}

static inline void process_thermal_line_fastest(
    const uint16_t * __restrict__ sensor_data,
    const uint16_t * __restrict__ dark,
    const uint16_t * __restrict__ gain,
    const uint16_t * __restrict__ offset,
    const uint16_t * __restrict__ planck_lut,
    uint16_t * __restrict__ output,
    uint32_t width)
{
    for (uint32_t x = 0; x < width; x += 8)
    {
        // Load
        uint16x8_t adc = vld1q_u16(&sensor_data[x]);
        uint16x8_t dark_val = vld1q_u16(&dark[x]);
        uint16x8_t gain_val = vld1q_u16(&gain[x]);


        // Dark subtract
        uint16x8_t corrected = vqsubq_u16(adc, dark_val);

        // ⭐ Gain (Q15) - Reinterpret as signed, multiply, reinterpret back
        int16x8_t corrected_s = vreinterpretq_s16_u16(corrected);
        int16x8_t gain_s = vreinterpretq_s16_u16(gain_val);
        int16x8_t result_s = vqrdmulhq_s16(corrected_s, gain_s);
        uint16x8_t result = vreinterpretq_u16_s16(result_s);

        // Planck LUT
        result = vldrhq_gather_shifted_offset_u16(planck_lut, result);

        // Store
        vst1q_u16(&output[x], result);
    }
}
void start_dark_frame_calibration(void) {
    printf("\n");
    printf("╔═══════════════════════════════════════════════╗\n");
    printf("║  Starting Dark Frame Calibration             ║\n");
    printf("╚═══════════════════════════════════════════════╝\n");
    printf("\n");

    printf("Parameters:\n");
    printf("  • Skip frames:    %d (settling time)\n", CALIB_SKIP_FRAMES);
    printf("  • Sample frames:  %d\n", CALIB_TOTAL_SAMPLES);
    printf("  • Total time:     ~%d ms\n",
           (CALIB_SKIP_FRAMES + CALIB_TOTAL_SAMPLES) * 20);
    printf("\n");

    // Initialize dark frame to zero (will be built up incrementally)
    printf("Initializing dark frame buffer...\n");
    for (uint32_t y = 0; y < VPIX; y++) {
        for (uint32_t x = 0; x < HPIX; x++) {
            frame_buffer_A[y][x] = 0;  // Use frame_buffer_A as temp storage
        }
    }

    // Reset state
    calib_state = CALIB_WAIT_STABLE;
    calib_frame_count = 0;
    calib_samples_collected = 0;

    printf("✓ Ready to capture\n");
    printf("\nWaiting for shutter to settle...\n");
}

/**
 * @brief Process one frame during calibration (call from main loop or ISR)
 * @param sensor_frame: Pointer to current sensor frame
 * @return 1 if calibration complete, 0 if still running
 */
uint8_t process_calibration_frame(const uint16_t sensor_frame[VPIX][HPIX]) {
    if (calib_state == CALIB_IDLE || calib_state == CALIB_COMPLETE) {
        return 1;  // Not calibrating or already done
    }

    calib_frame_count++;

    // State: Waiting for shutter to settle
    if (calib_state == CALIB_WAIT_STABLE) {
        if (calib_frame_count >= CALIB_SKIP_FRAMES) {
            calib_state = CALIB_COLLECTING;
            printf("Shutter stable. Collecting samples...\n");
        }
        return 0;  // Still running
    }

    // State: Collecting samples
    if (calib_state == CALIB_COLLECTING) {
        calib_samples_collected++;

        printf("  Sample %lu/%d...\n",
               calib_samples_collected, CALIB_TOTAL_SAMPLES);

        // Incremental averaging (no accumulator needed!)
        // avg_new = avg_old + (sample - avg_old) / n

        for (uint32_t y = 0; y < VPIX; y++) {
            for (uint32_t x = 0; x < HPIX; x++) {
                uint16_t current_avg = frame_buffer_A[y][x];
                uint16_t new_sample = sensor_frame[y][x];

                // Incremental average
                int32_t diff = (int32_t)new_sample - (int32_t)current_avg;
                int32_t delta = diff / (int32_t)calib_samples_collected;
                int32_t new_avg = (int32_t)current_avg + delta;

                // Clamp to valid range
                if (new_avg < 0) new_avg = 0;
                if (new_avg > 65535) new_avg = 65535;

