ReneLuedecke/stm32-helium-demo/Projects/NUCLEO-N657X0-Q/Examples/CORTEX/CORTEX_HELIUM/FSBL/Src/main.c
                frame_buffer_A[y][x] = (uint16_t)new_avg;
            }
        }

        // Check if done
        if (calib_samples_collected >= CALIB_TOTAL_SAMPLES) {
            calib_state = CALIB_COMPLETE;

            printf("\n✓ Calibration complete!\n");
            printf("  Total frames: %lu\n", calib_frame_count);
            printf("  Samples used: %lu\n", calib_samples_collected);
            printf("\n");

            printf("Copying to dark_frame array...\n");
            for (uint32_t y = 0; y < VPIX; y++) {
                for (uint32_t x = 0; x < HPIX; x++) {
                    dark_frame[y][x] = frame_buffer_A[y][x];
                }
            }
            printf("✓ Dark frame stored in AXISRAM1\n");

            printf("Dark frame ready for use.\n");
            printf("\n");

            return 1;  // Complete!
        }

        return 0;  // Still collecting
    }

    return 1;  // Should not reach here
}

/**
 * @brief Check if calibration is in progress
 */
uint8_t is_calibrating(void) {
    return (calib_state != CALIB_IDLE && calib_state != CALIB_COMPLETE);
}
/* USER CODE END 4 */
/* USER CODE END 0 */

/**
  * @brief  The application entry point.
  * @retval int
  */
int main(void)
{

  /* USER CODE BEGIN 1 */
  /* USER CODE END 1 */

  /* Enable the CPU Cache */

  /* Enable I-Cache---------------------------------------------------------*/
  SCB_EnableICache();

  /* Enable D-Cache---------------------------------------------------------*/
  SCB_EnableDCache();

  /* MCU Configuration--------------------------------------------------------*/
  HAL_Init();

  /* USER CODE BEGIN Init */

  /* USER CODE END Init */

  /* Configure the system clock */
  SystemClock_Config();

  /* USER CODE BEGIN SysInit */

  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_USART1_UART_Init();
  MX_XSPI2_Init();
  /* USER CODE BEGIN 2 */
  /* USER CODE BEGIN 2 */

    // ═══════════════════════════════════════════════════════════════════
    // STM32N6 Thermal Imaging System - Production Code
    // 66 FPS Processing Pipeline (31 us/line)
    // ═══════════════════════════════════════════════════════════════════

    printf("\n");
    printf("╔════════════════════════════════════════════════╗\n");
    printf("║  STM32N6 Thermal Imaging System               ║\n");
    printf("║  Production Code - 66 FPS Pipeline            ║\n");
    printf("╚════════════════════════════════════════════════╝\n");
    printf("\n");


    init_planck_lut();

    // ────────────────────────────────────────────────────────────────────
    // Initialize XSPI Memory-Mapped Mode
    // ────────────────────────────────────────────────────────────────────
    printf("Initializing XSPI Memory-Mapped Mode...\n");

    XSPI_NOR_OctalDTRModeCfg(&hxspi2);

    // READ configuration
    XSPI_RegularCmdTypeDef sRead = {0};
    sRead.OperationType        = HAL_XSPI_OPTYPE_READ_CFG;
    sRead.Instruction          = OCTAL_IO_DTR_READ_CMD;
    sRead.InstructionMode      = HAL_XSPI_INSTRUCTION_8_LINES;
    sRead.InstructionWidth     = HAL_XSPI_INSTRUCTION_16_BITS;
    sRead.InstructionDTRMode   = HAL_XSPI_INSTRUCTION_DTR_ENABLE;
    sRead.AddressMode          = HAL_XSPI_ADDRESS_8_LINES;
    sRead.AddressWidth         = HAL_XSPI_ADDRESS_32_BITS;
    sRead.AddressDTRMode       = HAL_XSPI_ADDRESS_DTR_ENABLE;
    sRead.DataMode             = HAL_XSPI_DATA_8_LINES;
    sRead.DataDTRMode          = HAL_XSPI_DATA_DTR_ENABLE;
    sRead.DummyCycles          = DUMMY_CLOCK_CYCLES_READ_OCTAL;
    sRead.DQSMode              = HAL_XSPI_DQS_ENABLE;
    sRead.AlternateBytesMode   = HAL_XSPI_ALT_BYTES_NONE;

    if (HAL_XSPI_Command(&hxspi2, &sRead, HAL_XSPI_TIMEOUT_DEFAULT_VALUE) != HAL_OK) {
        printf("✗ XSPI READ-CFG failed\n");
        Error_Handler();
    }

    // WRITE configuration
    XSPI_RegularCmdTypeDef sWrite = {0};
    sWrite.OperationType       = HAL_XSPI_OPTYPE_WRITE_CFG;
    sWrite.Instruction         = OCTAL_PAGE_PROG_CMD;
    sWrite.InstructionMode     = HAL_XSPI_INSTRUCTION_8_LINES;
    sWrite.InstructionWidth    = HAL_XSPI_INSTRUCTION_16_BITS;
    sWrite.InstructionDTRMode  = HAL_XSPI_INSTRUCTION_DTR_ENABLE;
    sWrite.AddressMode         = HAL_XSPI_ADDRESS_8_LINES;
    sWrite.AddressWidth        = HAL_XSPI_ADDRESS_32_BITS;
    sWrite.AddressDTRMode      = HAL_XSPI_ADDRESS_DTR_ENABLE;
    sWrite.DataMode            = HAL_XSPI_DATA_8_LINES;
    sWrite.DataDTRMode         = HAL_XSPI_DATA_DTR_ENABLE;
    sWrite.DummyCycles         = 0;
    sWrite.DQSMode             = HAL_XSPI_DQS_DISABLE;
    sWrite.AlternateBytesMode  = HAL_XSPI_ALT_BYTES_NONE;

    if (HAL_XSPI_Command(&hxspi2, &sWrite, HAL_XSPI_TIMEOUT_DEFAULT_VALUE) != HAL_OK) {
        printf("✗ XSPI WRITE-CFG failed\n");
        Error_Handler();
    }

    // Enter Memory-Mapped mode
    XSPI_MemoryMappedTypeDef sMMAP = {0};
    sMMAP.TimeOutActivation  = HAL_XSPI_TIMEOUT_COUNTER_ENABLE;
    sMMAP.TimeoutPeriodClock = 0x50;

    if (HAL_XSPI_MemoryMapped(&hxspi2, &sMMAP) != HAL_OK) {
        printf("✗ XSPI Memory-Mapped failed\n");
        Error_Handler();
    }

    // Configure MPU for XSPI
    xspi_mmap_base = XSPI2_MMAP_BASE;
    uint32_t xspi_mmap_end = xspi_mmap_base + XSPI_MMAP_SIZE - 1;

    ARM_MPU_Region_t mpu_table[] = {
      {
        .RBAR = ARM_MPU_RBAR(xspi_mmap_base, ARM_MPU_SH_NON, 0, 1, 0),
        .RLAR = ARM_MPU_RLAR(xspi_mmap_end, 0)
      }
    };

    ARM_MPU_Disable();
    ARM_MPU_SetMemAttr(0, ARM_MPU_ATTR(
      ARM_MPU_ATTR_MEMORY_(1,0,1,0),  // Outer: WB/WA
      ARM_MPU_ATTR_MEMORY_(1,0,1,0)   // Inner: WB/WA
    ));
    ARM_MPU_Load(0, mpu_table, 1);
    ARM_MPU_Enable(MPU_CTRL_PRIVDEFENA_Msk);
    __DSB(); __ISB();

    printf("✓ XSPI Memory-Mapped Mode ready\n");

    // ────────────────────────────────────────────────────────────────────
    // Initialize Thermal Pipeline
    // ────────────────────────────────────────────────────────────────────
    printf("\nInitializing thermal pipeline...\n");

    // Initialize DWT cycle counter
    DWT_CycleCounter_Init();

    // Initialize Planck LUT (dummy for now)
    printf("  • Planck LUT...");
    for (uint32_t i = 0; i < 65536; i++) {
        planck_table[i] = (uint16_t)i;  // TODO: Real Planck function
    }
    printf(" ✓\n");

    // Initialize test data (dummy sensor frame)
    printf("  • Test pattern...");
    for (uint32_t y = 0; y < VPIX; y++) {
        for (uint32_t x = 0; x < HPIX; x++) {
            frame_buffer_A[y][x] = 8000 + (x % 100);  // Dummy ADC values
        }
    }
    printf(" ✓\n");

    // Initialize calibration data (dummy)
    printf("  • Calibration data...");
    for (uint32_t i = 0; i < HPIX; i++) {
        dark_line[i] = 100 + (i % 10);       // Dummy dark frame
        gain_line[i] = gain_to_q15(1.0f);    // Unity gain
        // offset in temp_line reused
    }
    printf(" ✓\n");

    // ────────────────────────────────────────────────────────────────────
    // Initialize 50 Hz Timer (VSYNC simulation)
    // ────────────────────────────────────────────────────────────────────
    printf("\nInitializing 50 Hz VSYNC timer...\n");
    thermal_vsync_init();
    thermal_vsync_start();

    printf("\n");
    printf("╔════════════════════════════════════════════════╗\n");
    printf("║  System Ready!                                 ║\n");
    printf("║  Processing @ 66 FPS (31 us/line)             ║\n");
    printf("║  LED toggle @ 66 Hz (visible on oscilloscope) ║\n");
    printf("╚════════════════════════════════════════════════╝\n");
    printf("\n");

    /* USER CODE END 2 */

